In [1]:
import pandas as pd
from supabase import create_client
from pymongo import MongoClient

# conexión a la base de datos operacional
url_operacional = 'https://ggvtnhsokxrroymxgres.supabase.co'
key_operacional = 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6ImdndnRuaHNva3hycm95bXhncmVzIiwicm9sZSI6InNlcnZpY2Vfcm9sZSIsImlhdCI6MTc0ODYzNTgwNCwiZXhwIjoyMDY0MjExODA0fQ.iRMSBrcUSlA-IpiofR6xc4W6_Dq-smhhMs6sBKHk_dA'
supabase_op = create_client(url_operacional, key_operacional)

# conexión a la base de datos de MongoDB
uri = 'mongodb+srv://naza:chauflix123@chauflix.g5rhogq.mongodb.net/'
client = MongoClient(uri)
mongo = client['chauflix']

# conexión al datawarehouse
url_dw = 'https://hcwyzlprqjlwqwdrfrco.supabase.co'
key_dw = 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6Imhjd3l6bHBycWpsd3F3ZHJmcmNvIiwicm9sZSI6InNlcnZpY2Vfcm9sZSIsImlhdCI6MTc0OTA3NjkzOSwiZXhwIjoyMDY0NjUyOTM5fQ.kslrFLfk4e6HRIPs60qjwna4XWiXIPiJSv7988QjLIo'
supabase_dw = create_client(url_dw, key_dw)

In [2]:
users = supabase_op.table('user').select('*').execute()

In [3]:
users_df = pd.DataFrame(users.data)

In [4]:
users_df.head()

,id,email,first_name,last_name,birth_date,gender,country_id
0,1,bensonjacob@yahoo.com,Jared,Edwards,1988-07-25,Male,17
1,2,mendozawilliam@jones-perry.org,Kara,Nelson,1980-07-14,Male,16
2,3,aaron74@nelson.com,Frank,Hines,1967-08-09,Male,39
3,4,scottjohn@hotmail.com,Kristina,Gonzalez,1973-07-30,Female,9
4,5,mitchelldonald@williams.com,Jaclyn,Fields,1985-11-14,Female,17

In [5]:
users_df = users_df[['id', 'birth_date', 'country_id', 'gender']]

In [6]:
countries = supabase_op.table('country').select('*').execute()
countries_df = pd.DataFrame(countries.data)

countries_df = countries_df[['id', 'name']]
countries_df.head()

   id       name
0   1  Argentina
1   2     Brazil
2   3     Canada
3   4     Mexico
4   5        USA

In [7]:
merged_df = pd.merge(users_df, countries_df, left_on='country_id', right_on='id', how='left')

merged_df.head()

   id_x  birth_date  country_id  gender  id_y         name
0     1  1988-07-25          17    Male    17  Netherlands
1     2  1980-07-14          16    Male    16       Russia
2     3  1967-08-09          39    Male    39      Tunisia
3     4  1973-07-30           9  Female     9      Uruguay
4     5  1985-11-14          17  Female    17  Netherlands

In [8]:
merged_df.drop(columns=['country_id', 'id_y']
                , inplace=True)

merged_df.rename(columns={'id_x': 'id', 'name': 'country'}, inplace=True)
merged_df.head()

   id  birth_date  gender      country
0   1  1988-07-25    Male  Netherlands
1   2  1980-07-14    Male       Russia
2   3  1967-08-09    Male      Tunisia
3   4  1973-07-30  Female      Uruguay
4   5  1985-11-14  Female  Netherlands